---
kind: method
id: M:Autodesk.Revit.DB.RoutingCriterionBase.Dispose
source: html/ad1fb8ae-e23f-11bb-e923-7b55a0d9f378.htm
---
# Autodesk.Revit.DB.RoutingCriterionBase.Dispose Method

Releases all resources used by the RoutingCriterionBase

## Syntax (C#)
```csharp
public void Dispose()
```